stress_test_result.txt
Com redis

$ npx autocannon -c 2000 -d 30 http://localhost:8080/deck
Running 30s test @ http://localhost:8080/deck
2000 connections


┌─────────┬─────────┬─────────┬─────────┬─────────┬────────────┬────────────┬─────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev      │ Max     │
├─────────┼─────────┼─────────┼─────────┼─────────┼────────────┼────────────┼─────────┤
│ Latency │ 1898 ms │ 3164 ms │ 7004 ms │ 7486 ms │ 3413.04 ms │ 1138.14 ms │ 8048 ms │
└─────────┴─────────┴─────────┴─────────┴─────────┴────────────┴────────────┴─────────┘
┌───────────┬─────┬──────┬───────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%  │ 2.5% │ 50%   │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────┼──────┼───────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 0   │ 0    │ 615   │ 1.018   │ 561,14  │ 196,69 │ 153     │
├───────────┼─────┼──────┼───────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 50 MB │ 82.8 MB │ 45.6 MB │ 16 MB  │ 12.4 MB │
└───────────┴─────┴──────┴───────┴─────────┴─────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

19k requests in 30.8s, 1.37 GB read


--------------------------------------------------------

Sem redis

$ npx autocannon -c 2000 -d 30 http://localhost:8080/deck/without-cache
Running 30s test @ http://localhost:8080/deck/without-cache
2000 connections


┌─────────┬─────────┬─────────┬─────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼─────────┼─────────┼─────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 1413 ms │ 5528 ms │ 9743 ms │ 10222 ms │ 5600.78 ms │ 2572.38 ms │ 10302 ms │
└─────────┴─────────┴─────────┴─────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬─────┬──────┬─────┬─────────┬─────────┬─────────┬────────┐
│ Stat      │ 1%  │ 2.5% │ 50% │ 97.5%   │ Avg     │ Stdev   │ Min    │
├───────────┼─────┼──────┼─────┼─────────┼─────────┼─────────┼────────┤
│ Req/Sec   │ 0   │ 0    │ 0   │ 113     │ 20,83   │ 35,03   │ 2      │
├───────────┼─────┼──────┼─────┼─────────┼─────────┼─────────┼────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 0 B │ 9.95 MB │ 1.83 MB │ 3.08 MB │ 176 kB │
└───────────┴─────┴──────┴─────┴─────────┴─────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 29

22k requests in 31.36s, 53.1 MB read
19k errors (4k timeouts)